1s/ERP/Conf/InformationRegisters/Лико_ЭтапыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЭтапыЗаказа</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПричиныБлокировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОСтатусеПоказанаНаТачпаде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиЭтапа</Name>
					<Comment>Заполняется при перемещении заказа через обработку "Этапы заказов"</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_НастройкиОпововещенияОбЭтапахЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_НастройкиОпововещенияОбЭтапахЗаказа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЭтапыЗаказа/Ext/RecordSetModule.bsl
Функция ПолучитьЭткеткиЗаказа(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ЗаказКлиентаТовары.Ссылка.ОсновнойМатериал КАК ОсновнойМатериал
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ";
		Запрос.УстановитьПараметр("Заказ", Заказ);

	    Этикетки = Запрос.Выполнить().Выгрузить();
		Возврат Этикетки;
КонецФункции // ПолучитьЭткеткиЗаказа()

Процедура ОтправитьОповещениеПриНеобходимости(Этап, Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.Лико_НастройкиОпововещенияОбЭтапахЗаказа КАК Лико_НастройкиОпововещенияОбЭтапахЗаказа
	|ГДЕ
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Этап = &Этап
	|	И Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ = &Заказ
	|	И Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.КонтрольЭтапов";
	Запрос.УстановитьПараметр("Этап", Этап);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Результат = Запрос.Выполнить().Выбрать();
	Этикетки = ПолучитьЭткеткиЗаказа(Заказ);
	Пока Результат.Следующий() Цикл
	    Адресат = Лико_Планирование.ПолучитьПочтуПользователя(Результат.Пользователь);
		Тема = "" + Заказ.Номер + "  перешел на этап """ + Этап.Наименование + """";
		Текст = Тема + Символы.ПС;
		Текст = Текст + Символы.ПС + "Этикетки:" + Символы.ПС;
		Для каждого Этикетка Из Этикетки Цикл
			
		    Текст = Текст  + "- " + Этикетка.НоменклатураНаименование + Символы.ПС;
	
		КонецЦикла; 

		Если Этикетки.Количество() <> 0 Тогда
		    Текст = Текст + " " + Символы.ПС +  "Основной материал:" + Символы.ПС;
			Текст = Текст + Этикетки[0].ОсновнойМатериал + Символы.ПС; 		
		КонецЕсли; 
		Текст = Текст + Символы.ПС + "https://dsp.ok-st.ru/orders-search?q=" + Заказ.Номер;
 
		Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат,,"textBody");
	
	КонецЦикла; 
КонецПроцедуры // ПроверитьНеобходимостьОтправкиОповещения()

Процедура ПередЗаписью(Отказ, Замещение)
	
	// <-- Начало Лико Яцун С. В. 20.01.2026
	МассивДляУдаления = Новый Массив;
	// <-- Конец Лико Яцун С. В. 20.01.2026
	Для каждого Запись Из ЭтотОбъект Цикл
		// <-- Начало Лико Яцун С. В. 16.01.2026 
		НеЗаписывать = Ложь;
		ПлощадкаЗаказа = Запись.Заказ.Площадка;
		Если ПлощадкаЗаказа <> Справочники.Лико_Площадки.Урал И ПлощадкаЗаказа <> Справочники.Лико_Площадки.Сибирь И Запись.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Производство И Запись.Заказ.ЧестныйЗнак Тогда
			Для каждого СтрТовары Из Запись.Заказ.Товары Цикл
				Если ЗначениеЗаполнено(СтрТовары.ЧестныйЗнак) И ЗначениеЗаполнено(СтрТовары.ЧестныйЗнак.Gtin) И НЕ ЗначениеЗаполнено(СтрТовары.ЧестныйЗнак.ДатаЭмиссии) Тогда
					МассивДляУдаления.Добавить(Запись); 
					НеЗаписывать = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если НеЗаписывать Тогда
			Продолжить;	
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 16.01.2026
		Если НачалоДня(ЭтотОбъект.Отбор.Период.Значение) = НачалоДня(ТекущаяДата()) Тогда 
			ОтправитьОповещениеПриНеобходимости(Запись.Этап, Запись.Заказ); 
		КонецЕсли;
		
	КонецЦикла;
	// <-- Начало Лико Яцун С. В. 20.01.2026
	Если МассивДляУдаления.Количество() > 0 Тогда
		Для каждого ЭлМас Из МассивДляУдаления Цикл
			ЭтотОбъект.Удалить(ЭлМас);		
			Сообщить("Необходимо заполнить Дату эмиссии. " +"Передача в производство отменена. " + "Заказ " + ЭлМас.Заказ.НомерБезПрефикса);
		КонецЦикла; 
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 20.01.2026	
	
КонецПроцедуры
